IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cla_softint_regs.xml
<module id="CLA_SOFTINT_REGS" HW_revision="" description="CLA SOFTINT Registers">
	<register id="SOFTINTEN" width="16" page="1" offset="0x0" internal="0" description="CLA Software Interrupt Enable Register">
		<bitfield id="TASK1" description="Configure Software Interrupt or End of Task interrupt." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TASK2" description="Configure Software Interrupt or End of Task interrupt." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TASK3" description="Configure Software Interrupt or End of Task interrupt." begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TASK4" description="Configure Software Interrupt or End of Task interrupt." begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TASK5" description="Configure Software Interrupt or End of Task interrupt." begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TASK6" description="Configure Software Interrupt or End of Task interrupt." begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TASK7" description="Configure Software Interrupt or End of Task interrupt." begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TASK8" description="Configure Software Interrupt or End of Task interrupt." begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTINTFRC" width="16" page="1" offset="0x2" internal="0" description="CLA Software Interrupt Force Register">
		<bitfield id="TASK1" description="Force CLA software interrupt for the corresponding task." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TASK2" description="Force CLA software interrupt for the corresponding task." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TASK3" description="Force CLA software interrupt for the corresponding task." begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TASK4" description="Force CLA software interrupt for the corresponding task." begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TASK5" description="Force CLA software interrupt for the corresponding task." begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TASK6" description="Force CLA software interrupt for the corresponding task." begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TASK7" description="Force CLA software interrupt for the corresponding task." begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TASK8" description="Force CLA software interrupt for the corresponding task." begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
</module>
